import styles from "./page.module.scss";

export default function Policy() {
  return (
    <div className={styles.policy}>
      <h2 className={styles.title}>
        Политика в отношении обработки персональных данных
      </h2>
      <div className={styles.textContainer}>
        <h3>1. Общие положения</h3>
        <p>
          1.1. Политика в отношении обработки персональных данных (далее —
          Политика) направлена на защиту прав и свобод физических лиц,
          персональные данные которых обрабатывает Общество с ограниченной
          ответственностью «Туристская фирма «Машук» г. Пятигорск (далее —
          Оператор).
        </p>
        <p>
          1.2. Политика разработана в соответствии с п. 2 ч. 1 ст. 18.1
          Федерального закона от 27 июля 2006 г. № 152-ФЗ «О персональных
          данных» (далее — ФЗ «О персональных данных»).
        </p>
        <p>
          1.3. Политика содержит сведения, подлежащие раскрытию в соответствии с
          ч. 1 ст. 14 ФЗ «О персональных данных», и является общедоступным
          документом.
        </p>
      </div>
      <div className={styles.textContainer}>
        <h3> 2. Сведения об операторе </h3>
        <p>
          2.1. Оператор ведет свою деятельность по адресу Ставропольский край,
          г. Пятигорск, ул. Акопянца, д. 14, пом. 3.
        </p>
      </div>
      <div className={styles.textContainer}>
        <h3>3. Сведения об обработке персональных данных</h3>
        <p>
          3.1. Оператор обрабатывает персональные данные на законной и
          справедливой основе для выполнения возложенных законодательством
          функций, полномочий и обязанностей, осуществления прав и законных
          интересов Оператора, работников Оператора и третьих лиц.
        </p>
        <p>
          3.2. Оператор получает персональные данные непосредственно у субъектов
          персональных данных. 3.3. Оператор обрабатывает персональные данные
          автоматизированным и неавтоматизированным способами, с использованием
          средств вычислительной техники и без использования таких средств.
        </p>
        <p>
          3.4. Действия по обработке персональных данных включают сбор, запись,
          систематизацию, накопление, хранение, уточнение (обновление,
          изменение), извлечение, использование, передачу (распространение,
          предоставление, доступ), обезличивание, блокирование, удаление и
          уничтожение.
        </p>
      </div>
      <div className={styles.textContainer}>
        <h3>4. Обработка персональных данных клиентов </h3>

        <p>
          4.1. Оператор обрабатывает персональные данные клиентов в рамках
          правоотношений с Оператором, урегулированных частью второй
          Гражданского Кодекса Российской Федерации от 26 января 1996 г. №
          14-ФЗ, (далее — клиентов).
        </p>
        <ul className={styles.list}>
          4.2. Оператор обрабатывает персональные данные клиентов в целях
          соблюдения норм законодательства РФ, а также с целью:{" "}
          <li className={styles.item}>
            информирование о новых предложениях и специальных акциях;{" "}
          </li>
          <li className={styles.item}>
            заключение и исполнение условий договора.
          </li>
        </ul>
        <p>
          4.3. Оператор обрабатывает персональные данные клиентов с их согласия,
          предоставляемого клиентами и/или их законными представителями путем
          совершения конклюдентных действий на настоящем интернет-сайте, в том
          числе, но не ограничиваясь, оформлением заказа, регистрацией в личном
          кабинете, подпиской на рассылку, в соответствии с настоящей Политикой.
        </p>
        <p>
          4.4. Оператор обрабатывает персональные данные клиентов не дольше, чем
          того требуют цели обработки персональных данных, если иное не
          предусмотрено требованиями законодательства РФ.
        </p>
        <ul>
          4.5. Оператор обрабатывает следующие персональные данные клиентов:
          <li className={styles.item}>фамилия, имя, отчество;</li>
          <li className={styles.item}>дата и место рождения;</li>
          <li className={styles.item}>паспортные данные;</li>
          <li className={styles.item}>данные свидетельства о рождении;</li>
          <li className={styles.item}>номер контактного телефона;</li>
          <li className={styles.item}> адрес электронной почты.</li>
        </ul>
        <ul>
          Персональные данные, которые автоматически передаются в процессе
          посещения страниц сайта:
          <li className={styles.item}>IP адрес;</li>
          <li className={styles.item}>информация из cookies;</li>
          <li className={styles.item}>
            информация о браузере (или иной программе, которая осуществляет
            доступ к сайту);
          </li>
          <li className={styles.item}>время доступа;</li>
          <li className={styles.item}>посещенные адреса страниц;</li>
          <li className={styles.item}>
            реферер (адрес предыдущей страницы) и т.п.
          </li>
        </ul>
      </div>
      <div className={styles.textContainer}>
        <h3> 5. Сведения об обеспечении безопасности персональных данных </h3>
        <p>
          5.1. Оператор назначает ответственного за организацию обработки
          персональных данных для выполнения обязанностей, предусмотренных ФЗ «О
          персональных данных» и принятыми в соответствии с ним нормативными
          правовыми актами.
        </p>
        <ul>
          5.2. Оператор применяет комплекс правовых, организационных и
          технических мер по обеспечению безопасности персональных данных для
          обеспечения конфиденциальности персональных данных и их защиты от
          неправомерных действий:
          <li className={styles.item}>
            обеспечивает неограниченный доступ к Политике, копия которой
            размещена по адресу нахождения Оператора, а также может быть
            размещена на сайте Оператора (при его наличии);
          </li>
          <li className={styles.item}>
            во исполнение Политики утверждает и приводит в действие документ
            «Положение об обработке персональных данных» (далее — Положение) и
            иные локальные акты;
          </li>
          <li className={styles.item}>
            производит ознакомление работников с положениями законодательства о
            персональных данных, а также с Политикой и Положением;
          </li>
          <li className={styles.item}>
            осуществляет допуск работников к персональным данным, обрабатываемым
            в информационной системе Оператора, а также к их материальным
            носителям только для выполнения трудовых обязанностей;
          </li>
          <li className={styles.item}>
            устанавливает правила доступа к персональным данным, обрабатываемым
            в информационной системе Оператора, а также обеспечивает регистрацию
            и учёт всех действий с ними;
          </li>
          <li className={styles.item}>
            производит оценку вреда, который может быть причинен субъектам
            персональных данных в случае нарушения ФЗ «О персональных данных»;
          </li>
          <li className={styles.item}>
            роизводит определение угроз безопасности персональных данных при их
            обработке в информационной системе Оператора;
          </li>
          <li className={styles.item}>
            применяет организационные и технические меры и использует средства
            защиты информации, необходимые для достижения установленного уровня
            защищенности персональных данных;
          </li>
          <li className={styles.item}>
            осуществляет обнаружение фактов несанкционированного доступа к
            персональным данным и принимает меры по реагированию, включая
            восстановление персональных данных, модифицированных или
            уничтоженных вследствие несанкционированного доступа к ним;{" "}
          </li>
          <li className={styles.item}>
            производит оценку эффективности принимаемых мер по обеспечению
            безопасности персональных данных до ввода в эксплуатацию
            информационной системы Оператора;
          </li>
          <li className={styles.item}>
            осуществляет внутренний контроль соответствия обработки персональных
            данных ФЗ «О персональных данных», принятым в соответствии с ним
            нормативным правовым актам, требованиям к защите персональных
            данных, Политике, Положению и иным локальным актам, включающий
            контроль за принимаемыми мерами по обеспечению безопасности
            персональных данных и их уровня защищенности при обработке в
            информационной системе Оператора.
          </li>
        </ul>
      </div>
      <div className={styles.textContainer}>
        <h3> 6. Права субъектов персональных данных </h3>
        <ul>
          6.1. Субъект персональных данных имеет право:
          <li className={styles.item}>
            на получение персональных данных, относящихся к данному субъекту, и
            информации, касающейся их обработки;
          </li>
          <li className={styles.item}>
            на уточнение, блокирование или уничтожение его персональных данных в
            случае, если они являются неполными, устаревшими, неточными,
            незаконно полученными или не являются необходимыми для заявленной
            цели обработки;
          </li>
          <li className={styles.item}>
            на отзыв данного им согласия на обработку персональных данных;
          </li>
          <li className={styles.item}>
            на защиту своих прав и законных интересов, в том числе на возмещение
            убытков и компенсацию морального вреда в судебном порядке;
          </li>
          <li className={styles.item}>
            на обжалование действий или бездействия Оператора в уполномоченный
            орган по защите прав субъектов персональных данных или в судебном
            порядке.
          </li>
        </ul>
        <p>
          6.2. Для реализации своих прав и законных интересов субъекты
          персональных данных имеют право обратиться к Оператору либо направить
          запрос лично или с помощью представителя. Запрос должен содержать
          сведения, указанные в ч. 3 ст. 14 ФЗ «О персональных данных».
        </p>
      </div>
    </div>
  );
}
